Типы данных   Диапазон значений       Описание

char 			-128 .. 127          — единичный байт, который может содержать один символ из допустимого символьного набора.
signed char 	-128 .. 127
unsigned char 	   0 .. 255

short  -       32768 .. 32767 		 — короткое целое;
signed short   32768 .. 32767
unsigned short     0 .. 65535		

long   -                             — длинное целое; 
signed long
unsigned long

double                               — с плавающей точкой с двойной точностью.



-----------------------------------------------------------------------------------
1. У каждого типа есть нижняя и верхняя граница.
2. У каждого типа есть модификатор (алиас / alias ).
	2.1 signed - со знаком (знак минус -, может использовать отрицательные числа).
	2.2 unsigned - без знака (только положительные числа, включая ноль).
3.


